app/views/storekeepers/order.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."storekeeper_id" = 1
SELECT COUNT(*) FROM "orders" WHERE "orders"."storekeeper_id" = 1
---
<br/>
<% if current_storekeeper.orders.any? %>

SELECT "order_its".* FROM "order_its" WHERE "order_its"."order_id" = 1
SELECT COUNT(*) FROM "order_its" WHERE "order_its"."order_id" = 1
---
<% @orders.each do |order| %>
  <% if order.order_its.any? %>

SELECT "items".* FROM "items" WHERE "items"."id" = 4 LIMIT 1
SELECT "stores".* FROM "stores" WHERE "stores"."storekeeper_id" = 8 LIMIT 1
---
    <td><% order.order_its.each do |item| %>
      <% if Item.find_by_id(item.item_number).store_id == @storekeeper.stores.first.id %>