app/views/storekeepers/show.html.erb

SELECT "stores".* FROM "stores" WHERE "stores"."storekeeper_id" = 7
SELECT COUNT(*) FROM "stores" WHERE "stores"."storekeeper_id" = 1
---
<div class="span8">
  <% if @storekeeper.stores.any? %>