app/views/stores/shop.html.erb


<% if @store.items.any? %>
---
SELECT "items".* FROM "items" WHERE "items"."store_id" = 3
SELECT COUNT(*) FROM "items" WHERE "items"."store_id" = 3