app/views/stores/show.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."store_id" = 3
---
<%= link_to 'New Item', new_item_path %>
<% if @store.items.any? %>