app/views/carts/show.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."cart_id" = 1
SELECT COUNT(*) FROM "items" WHERE "items"."cart_id" = 1
---

<% if @cart.cart_items.any? %>

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
---
  <% @cart.cart_items.each do |item| %>
    <% if Item.find_by_id(item.item_number) %>