app/views/items/show.html.erb

SELECT "stores".* FROM "stores" WHERE "stores"."storekeeper_id" = 6 LIMIT 1
---
<%= link_to 'Edit', edit_item_path(@item) %> |
<%= link_to 'Back', current_storekeeper.stores.first %>