app/controllers/carts_controller.rb

  def show
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "1"]]

  def checkout
    @cart = Cart.find(params[:id])
    @customer = current_storekeeper
    @order = @customer.orders.new()
    @order.update_attributes(customer_id: @customer.id, id: @cart.id)
    @cart.cart_items.each do |item|
    @item = @order.order_its.new()
    @item.update_attributes(item_number: item.item_number)
    item.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def create
    @cart = current_storekeeper.carts.build(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "storekeeper_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 09 Oct 2012 03:23:44 UTC +00:00], ["storekeeper_id", 1], ["updated_at", Tue, 09 Oct 2012 03:23:44 UTC +00:00]]

  def destroy_item
    @cart_item = CartItem.find_by_id(params[:id])
    @cart_item.destroy
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT 1  [["id", "27"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 27]]