app/controllers/items_controller.rb

  def edit
    @item = Item.find(params[:id])
    @store = Store.find_by_id(@item.store_id)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "stores".* FROM "stores" WHERE "stores"."id" IS NULL LIMIT 1

  def basket
    @item = Item.find(params[:id])
    @current_storekeeper = current_storekeeper
    @quantity = @item.quantity.to_i - 1
    @id = @item.id
    @store_id = @item.store_id
    @item.update_attributes(quantity: @quantity)
    @cart = Cart.find(params[:sid])
    if @cart
      @new_item = current_storekeeper.carts.first.cart_items.build()
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "items" SET "quantity" = -1, "updated_at" = '2012-10-09 19:38:28.425913' WHERE "items"."id" = 1
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "carts".* FROM "carts" WHERE "carts"."storekeeper_id" = 1 LIMIT 1

  def create
    @item = current_storekeeper.stores.first.items.build(params[:item])

    respond_to do |format|
      if @item.save
---
SELECT "stores".* FROM "stores" WHERE "stores"."storekeeper_id" = 1 LIMIT 1
INSERT INTO "items" ("cart_id", "created_at", "description", "name", "price", "quantity", "store_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "4"]]