app/controllers/saveds_controller.rb

SELECT "saveds".* FROM "saveds" WHERE "saveds"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @saved = Saved.find(params[:id])

INSERT INTO "saveds" ("created_at", "item_id", "storekeeper_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 05 Nov 2012 01:24:17 UTC +00:00], ["item_id", 1], ["storekeeper_id", 1], ["updated_at", Mon, 05 Nov 2012 01:24:17 UTC +00:00]]
---
  def create
    @saved = Saved.new(params[:saved])

    respond_to do |format|
      if @saved.save

SELECT "saveds".* FROM "saveds" WHERE "saveds"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @saved = Saved.find(params[:id])

SELECT "saveds".* FROM "saveds" WHERE "saveds"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "saveds" WHERE "saveds"."id" = ?  [["id", 980190962]]
---
  def destroy
    @saved = Saved.find(params[:id])
    @saved.destroy