app/controllers/sessions_controller.rb

  def create
    storekeeper = Storekeeper.find_by_email(params[:session][:email].downcase)
---
SELECT "storekeepers".* FROM "storekeepers" WHERE "storekeepers"."email" = 'mmiyachi@mit.edu' LIMIT 1