app/controllers/storekeepers_controller.rb

  def index
    @storekeepers = Storekeeper.all
---
SELECT "storekeepers".* FROM "storekeepers"

  def show
    @storekeeper = Storekeeper.find(params[:id])
---
SELECT "storekeepers".* FROM "storekeepers" WHERE "storekeepers"."id" = ? LIMIT 1  [["id", "2"]]

  def order
    @storekeeper = Storekeeper.find(params[:id])
    @orders = Order.all
---
SELECT "storekeepers".* FROM "storekeepers" WHERE "storekeepers"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "orders".* FROM "orders" WHERE "orders"."storekeeper_id" = 1

  def edit
    @storekeeper = Storekeeper.find(params[:id])
---
SELECT "storekeepers".* FROM "storekeepers" WHERE "storekeepers"."id" = ? LIMIT 1  [["id", "5"]]

  def create
    @storekeeper = Storekeeper.new(params[:storekeeper])
    @cart = @storekeeper.carts.build(params[:cart])
    if @storekeeper.save
---
INSERT INTO "carts" ("created_at", "storekeeper_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 09 Oct 2012 23:32:28 UTC +00:00], ["storekeeper_id", nil], ["updated_at", Tue, 09 Oct 2012 23:32:28 UTC +00:00]]
INSERT INTO "storekeepers" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @storekeeper = Storekeeper.find(params[:id])

    respond_to do |format|
      if @storekeeper.update_attributes(params[:storekeeper])
---
SELECT "storekeepers".* FROM "storekeepers" WHERE "storekeepers"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "storekeepers" SET "password_digest" = '$2a$10$EoD1wqmjQAQ27LH8zWSvAOa65EYX5Gwr8oFBNxdnbkDRbr82PaYra', "remember_token" = 'SGAKyrU5LEaT-laph1QXxA', "updated_at" = '2012-10-13 17:18:41.776737' WHERE "storekeepers"."id" = 5

  def destroy
    @storekeeper = Storekeeper.find(params[:id])
    @storekeeper.destroy
---
SELECT "storekeepers".* FROM "storekeepers" WHERE "storekeepers"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "storekeepers" WHERE "storekeepers"."id" = ?  [["id", 980190962]]