app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores"
---
  def index
    @stores = Store.all

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @store = Store.find(params[:id])

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "3"]]
---
  def shop
    @store = Store.find(params[:id])

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @store = Store.find(params[:id])

INSERT INTO "stores" ("created_at", "description", "name", "storekeeper_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 08 Oct 2012 22:48:44 UTC +00:00], ["description", "test"], ["name", "test"], ["storekeeper_id", nil], ["updated_at", Mon, 08 Oct 2012 22:48:44 UTC +00:00]]
---
  def create
    @store = current_storekeeper.stores.build(params[:store])

    respond_to do |format|
      if @store.save

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "4"]]
---
  def update
    @store = Store.find(params[:id])

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 2]]
---
  def destroy
    @store = Store.find(params[:id])
    @store.destroy